{
  "language": "Language",
  "aboutMeTitle": "About Me",
  "aboutMeDescription": "My name is Marie. I am a software engineer who graduated from the National Institute of Applied Sciences, or INSA, from Toulouse, France. I work in software and web development, and I am also interested in video game development. In this portfolio, you will be able to discover my skills, the projects that I lead and participated in, my education and finally, my socials and contact information.",
  "downloadCV": "Download Resume",

  "skillsTitle": "Skills",
  "languages": "Languages",
  "programmingLanguages": "Programming Languages",
  "webDevelopment": "Web Development",
  "otherConceptsAndTechnologies": "Other Concepts and Technologies",
  "englishLanguageTitle": "English",
  "englishLanguageDescription": "Advanced, TOEIC 975/990",
  "frenchLanguageTitle": "French",
  "frenchLanguageDescription": "Native",
  "italianLanguageTitle": "Italian",
  "italianLanguageDescription": "Conversationnal",
  "germanLanguageTitle": "German",
  "germanLanguageDescription": "Notions",
  "agileMethodology": "Agile Methodology",
  "oopTitle": "Object-Oriented Programming",

  "projectsTitle": "Projects",
  "softwareWeb": "Software and Web Development",
  "gameDev": "Game Development",
  "other": "Other",
  "formation": "Formation",
  "graphics": "Graphics",
  "customerContact": "Customer contact",
  "english": "English",
  "italian": "Italian",
  "portfolioProjectTitle": "Portfolio",
  "portfolioProjectDescription": "This portfolio is a personal project that I developed to showcase my skills and projects. It is built with Vue.js, Quasar, and Typescript. The source code is available on my GitHub.",
  "googleSheetsProjectTitle": "Google Sheets Project",
  "googleSheetsProjectDescription": "This project is a Google Sheets document that I created to manage my personal finances. It includes various sheets for tracking income, expenses, and savings goals. The document is automated with Google Apps Script to provide reminders and calculations.",
  "unityFormationProjectTitle": "Unity Formation",
  "unityFormationProjectDescription": "During my formation at INSA, and with the help of the computer science club, I was able to introduce the Unity software and C# development to first to third year students.",
  "jourDeNeigeProjectTitle": "Jour de Neige - Point And Click",
  "jourDeNeigeProjectDescription": "This project is a Unity game that I developed during a secret santa. It is a point and click game where the objective is to find your winter outfit in order to enjoy the first snow. Access with \"KDO\"",
  "colorsVNProjectTitle": "Colors - Visual Novel",
  "colorsVNProjectDescription": "I had the opportunity to participate in a 2-month game jam, the SuNoFes, where I was able to create the graphical elements of a visual novel named Colors. It is a visual novel about a child who seeks to recover color orbs to restore his father's sight.",
  "l2SpeakProjectTitle": "L2 Speak",
  "l2SpeakProjectDescription": "L2 Speak is a foreign language learning game that immerses the player in an environment where they must interact in the chosen language to progress. I was able to create many backgrounds and help with the French translation.",
  "freelanceProjectTitle": "Freelance Pixel Art Graphic Designer",
  "freelanceProjectDescription": "As a freelance pixel art graphic designer, I create animations and illustrations in a pixel art style. I communicate with international clients in English and French, adhering to specifications and deadlines defined in advance.",
  "asepriteScriptsProjectTitle": "Aseprite Scripts",
  "asepriteScriptsProjectDescription": "Aseprite is a pixel art creation software that supports external scripts in Lua. To automate certain tasks, I created several scripts to facilitate pixel art creation.",

  "educationAndExperienceTitle": "Education and Experience",
  "softwareEngineer": "Software Engineer",
  "tasToulouseDescription": "Development of three software tools for an electronic card design and production department. \n Tools I work on: \n - A software developed with Unity and C#. This tool allows PCB modeling and automatic creation of associated technical documents, \n - Two software developed with Vue.js, Typescript, and Electron. These are tools for managing the traceability of electronic card manufacturing and design, as well as managing these cards in a shared SQL database.",
  "tasToulouseFrance": "Thales Alenia Space - Toulouse, France",
  "webDeveloper": "Web Developer",
  "avlDescription": "Fullstack development of an internal web tool using the Retrieval-Augmented Generation (RAG) principle, based on AI, to easily find information scattered across many documents and images. Development was done from design to deployment, with a user feedback phase to correct and add features to the page.\n Used technologies:\n - NiceGUI, a Python framework, for the front end \n - Python for the back-end\n - Qdrant and PostGreSQL for vector databases",
  "avlRegensburgGermany": "AVL - Regensburg, Germany",
  "softwareDeveloper": "Software Developer",
  "tasTurinDescription": " - Development of a library for the Capella software\n - Conversion of data from various software into Python to import them into Unreal Engine\n - Writing documentation for the work done\n - Reporting tasks in Italian and English",
  "tasTurinItaly": "Thales Alenia Space - Turin, Italy",
  "computerScienceMaster": "Computer Science and Networks Engineering Master",
  "insaDescription": "Common core training 2020-2021\nPre-orientation in Modeling, Computer Science, and Communication (MIC) 2021-2023\nSpecialization in Computer Science and Networks Engineering (IR) 2023-2025\n\nCourses taken: \n - Statistics, Analysis, Algebra, Linear Programming\n - Advanced Algorithms, Object-Oriented Programming, Web Programming (HTML, CSS, JavaScript), C language, Python\n - Networks, Operating Systems, Database Management",
  "insaToulouseFrance": "INSA - Toulouse, France",
  "highschoolDiplomaTitle": "Scientific Baccalaureate",
  "highschoolDiplomaDescription": "Graduated with honors. General track, engineering science option, Computer Science and Digital Science specialty, European Italian section",
  "costebelleHyeresFrance": "Lycée Costebelle - Hyères, Var, France",
  "pixelArtFreelanceTitle": "Freelance 2D Pixel Artist",
  "pixelArtFreelanceDescription": "Online creation of animations and illustrations in a digital and pixel art style as a sole proprietorship (Marie Pepo)\n - Communication with international clients in English and French,\n - Adherence to specifications and deadlines defined in advance with the client.",

  "socialsTitle": "My socials",
  "gameAssetsAndScripts": "Game Assets and Scripts",
  "videoGamesAndGameJams": "Video Games and Game Jams",
  "professionalSoftwareEngineer": "My software engineer contact",
  "pixelArtistEI": "My freelance pixel artist contact"
}
