{
  "aboutMeTitle": "À propos",
  "aboutMeDescription": "Je m’appelle Marie. Je suis une ingénieure logiciel diplômée de l’INSA, Institut National des Sciences Appliquées de Toulouse. Je travaille dans le développement web et logiciel, mais je suis également passionnée par le développement de jeux vidéo. À travers ce portfolio, vous pourrez découvrir mes compétences, les projets qui j’ai suivi et menés, mon éducation et enfin accéder à mes contacts et réseaux.",
  "downloadCV": "Télécharger le CV",

  "skillsTitle": "Compétences",
  "languages": "Langues",
  "programmingLanguages": "Langages de programmation",
  "webDevelopment": "Développement web",
  "otherConceptsAndTechnologies": "Autres concepts et technologies",
  "englishLanguageTitle": "Anglais",
  "englishLanguageDescription": "Professionnel, TOEIC 975/990",
  "frenchLanguageTitle": "Français",
  "frenchLanguageDescription": "Maternel",
  "italianLanguageTitle": "Italien",
  "italianLanguageDescription": "Conversationnel",
  "germanLanguageTitle": "Allemand",
  "germanLanguageDescription": "Notions",
  "agileMethodology": "Méthodologie Agile",
  "oopTitle": "Programmation Orientée Objet",

  "projectsTitle": "Projets",

  "educationAndExperienceTitle": "Éducation et Expérience",
  "softwareEngineer": "Ingénieure Logiciel",
  "tasToulouseDescription": "Développement de trois outils logiciels à destination d'un département de conception et production de carte électroniques. \n Outils sur lesquels je travaille : \n - Un logiciel réalisé sous Unity et C#. Cet outil permet la modélisation de PCB et la création automatique des documents techniques associés, \n - Deux logiciel réalisé avec Vue.js, Typescript et Electron. Il s'agit d'outils de gestion de la traçabilité de la fabrication et conception des cartes électroniques, ainsi que la gestion de ces cartes dans une base de donnée SQL partagée.",
  "tasToulouseFrance": "Thales Alenia Space - Toulouse, France",
  "webDeveloper": "Développeuse Web",
  "avlDescription": "Développement fullstack d'un outil web interne utilisant le principe de Retrieval-Augmented Generation (RAG), reposant sur de l'IA, pour retrouver des informations dispersées dans de nombreux documents et images avec facilité. Développement réalisé de la conception au déploiement, avec une phase de retours utilisateurs pour corriger et ajouter des fonctionnalités à la page.\n Utilisation de :\n - NiceGUI, framework python, pour réaliser le front end \n - Python pour le back-end\n - Qdrant et PostGreSQL pour les bases de données vectorielles",
  "avlRegensburgGermany": "AVL - Ratisbonne, Allemagne",
  "softwareDeveloper": "Développeuse Logiciel",
  "tasTurinDescription": " - Développement d'une librairie pour le logiciel Capella\n - Conversion des données de divers logiciels en Python afin de les importer dans Unreal Engine\n - Rédaction de la documentation pour le travail réalisé\n - Compte rendu des tâches en italien et en anglais",
  "tasTurinItaly": "Thales Alenia Space - Turin, Italie",
  "computerScienceDegree": "Diplôme d'ingénieur en informatique et réseaux",
  "insaDescription": "Formation en tronc commun 2020-2021\nPré-orientation en Modélisation, Informatique et Communication (MIC) 2021-2023\nSpécialité Ingénieur en Informatique et Réseaux (IR) 2023-2025\n\nCours suivis : \n - Statistiques, Analyse, Algèbre, Programmation linéaire\n - Algorithmique avancée, Programmation Orientée Objet, Programmation Web (HTML, CSS, JavaScript), language C, Python\n - Réseaux, Systèmes d'exploitations, Gestion de base de donnée",
  "insaToulouseFrance": "INSA - Toulouse, France",
  "highschoolDiplomaTitle": "Baccalauréat Scientifique",
  "highschoolDiplomaDescription": "Mention très bien. Filière générale, option science de l'ingénieur, spécialité Informatique et Science du Numérique, section italien européen",
  "costebelleHyeresFrance": "Lycée Costebelle - Hyères, Var, France",
  "pixelArtFreelanceTitle": "Graphiste 2D indépendante (EI)",
  "pixelArtFreelanceDescription": "Création en ligne d'animations et d'illustrations dans un style digital et pixel art en Entreprise Individuelle (Marie Pepo)\n - Communication avec des clients internationaux en anglais et français,\n - Respect de cahiers des charges et de deadlines définies en amont avec le client.",

  "socialsTitle": "Mes réseaux",
  "gameAssetsAndScripts": "Assets de jeu et scripts",
  "videoGamesAndGameJams": "Jeux vidéo et Game Jams",
  "professionalSoftwareEngineer": "Mon contact en tant qu'ingénieur logiciel",
  "pixelArtistEI": "Mon contact en tant que pixel artist en auto entreprise"
}
